#+TITLE: Matematikk R2
#+TODO: PLANLAGT | AVHOLDT DONE
#+TODO: | KANSELLERT
#+TODO: OBS | 

* Uke 34 - onsdag
:LOGBOOK:
CLOCK: [2020-08-22 Sat 19:01]--[2020-08-22 Sat 19:20] =>  0:19
- State "AVHOLDT"    from "PLANLAGT"   [2020-08-19 Wed 15:32] \\
  For mye tekst. Gikk også gjennom «funksjoner som bokser».
CLOCK: [2020-08-19 Wed 12:55]--[2020-08-19 Wed 15:32] =>  2:37
CLOCK: [2020-08-19 Wed 11:35]--[2020-08-19 Wed 12:04] =>  0:29
CLOCK: [2020-08-18 Tue 12:30]--[2020-08-18 Tue 12:37] =>  0:07
CLOCK: [2020-08-17 Mon 12:37]--[2020-08-17 Mon 13:42] =>  1:05
CLOCK: [2020-08-12 Wed 14:24]--[2020-08-12 Wed 15:08] =>  0:44
- [2020-08-05 Wed 14:07] \\
  Her bør det komme inn noe fra cite:strogatz19_infin_power.
CLOCK: [2020-08-05 Wed 13:15]--[2020-08-05 Wed 13:35] =>  0:20
CLOCK: [2020-08-05 Wed 10:38]--[2020-08-05 Wed 11:00] =>  0:22
- [2020-08-05 Wed 10:35] \\
  Grovskisse av økt-framgang
CLOCK: [2020-08-05 Wed 09:54]--[2020-08-05 Wed 10:35] =>  0:41
CLOCK: [2020-07-19 Sun 12:34]--[2020-07-19 Sun 12:34] =>  0:00
:END:
<2020-08-19 Wed 13:00-15:30>
- Alle rundt i ring, introdusere deg -- bytte navn
- Stå overfor hverandre, introdusere og si to ting

- Hvor er vi nå?
- Opplegget for dette faget

- 1.1 :: Derivasjon
- 1.2 :: Ubestemt integral

* Uke 35 - mandag
:LOGBOOK:
- [2020-08-26 Wed 15:23] \\
  Altfor mye tid på tavla ... igjen.
CLOCK: [2020-08-26 Wed 13:01]--[2020-08-26 Wed 15:23] =>  2:22
CLOCK: [2020-08-26 Wed 10:11]--[2020-08-26 Wed 10:20] =>  0:09
CLOCK: [2020-08-25 Tue 13:09]--[2020-08-25 Tue 15:17] =>  2:08
- [2020-08-24 Mon 21:48] \\
  Det blei litt lite tid til å jobbe med oppgaver. Jeg trur det gjelder å finne en arbeidsform som gjør at det blir mer tid til det i timen, og mindre til at jeg går gjennom stoffet fra boka. Kanskje hadde det vært lurere om jeg jobba på en måte à la Jan B. Aarseth i Statisk mekanikk, hvor han stort sett jobbet seg gjennom ett eller to spesifikke, ordentlige eksempler. Hva tenker du?
- [2020-08-24 Mon 13:49] \\
  Gitt litt over tida, det blei stress på slutten.
- [2020-08-24 Mon 13:20] \\
  Det blir litt lite tid til å jobbe med oppgaver.
- [2020-08-24 Mon 12:44] \\
  Gikk gjennom skrivemåte $\int f(x) dx$.
CLOCK: [2020-08-24 Mon 12:13]--[2020-08-24 Mon 13:49] =>  1:36
CLOCK: [2020-08-24 Mon 11:07]--[2020-08-24 Mon 11:49] =>  0:42
CLOCK: [2020-08-19 Wed 12:14]--[2020-08-19 Wed 12:43] =>  0:29
:END:
<2020-08-24 Mon 12:15-13:45>
- [X] 1.3 :: Integralet $\int \frac{1}{x} dx$
- [X] 1.4 :: Integrasjon av eksponentialfunksjoner
- [X] 1.5 :: Bestemt integral som grense for en sum

* Uke 35 - onsdag
:LOGBOOK:
- [2020-09-01 Tue 13:08] \\
  Retting av første minitest.
CLOCK: [2020-09-01 Tue 12:40]--[2020-09-01 Tue 13:07] =>  0:27
:END:
<2020-08-26 Wed 13:00-15:30>
- [X] 1.6 :: Bestemt integral og antiderivasjon
- [X] [[file:minitester/mt1_integrasjon.pdf][Minitest - Integrasjon]]

* Uke 36 - mandag
:LOGBOOK:
- [2020-08-31 Mon 15:30] \\
  Bra time med  kun gjennomgang av oppgave.
CLOCK: [2020-08-31 Mon 12:13]--[2020-08-31 Mon 13:47] =>  1:34
- [2020-08-27 Thu 12:03] \\
  Møt Dorthe fem minutter før.
CLOCK: [2020-08-27 Thu 09:26]--[2020-08-27 Thu 09:27] =>  0:01
CLOCK: [2020-08-25 Tue 16:03]--[2020-08-25 Tue 16:21] =>  0:18
:END:
<2020-08-31 Mon 12:15-13:45>

- [X] 1.7 :: Mer om integrasjon og areal

* Uke 36 - onsdag
:LOGBOOK:
CLOCK: [2020-09-01 Tue 13:09]--[2020-09-01 Tue 13:42] =>  0:33
:END:
<2020-09-02 Wed 13:00-15:30>

- Arbeid med oppgaver fra kapittel 1.

- [X] 2.1 :: Vinkelmål

Lenker:
- https://en.wikipedia.org/wiki/Radian

* Uke 37 - mandag
:LOGBOOK:
CLOCK: [2020-09-01 Tue 15:05]--[2020-09-01 Tue 15:14] =>  0:09
:END:
<2020-09-07 Mon 12:15-13:45>
- [X] 2.2 :: Sinus og cosinus (2.25 a, og 2.24 c)

** DONE Samarbeidsdag med Sigrid
:LOGBOOK:
CLOCK: [2020-06-09 Tue 09:22]--[2020-06-09 Tue 12:36] =>  3:14
:END:
** Planleggingsmøte med Anna
:PROPERTIES:
:ROOM:     personal
:END:
:LOGBOOK:
CLOCK: [2020-08-17 Mon 13:42]--[2020-08-17 Mon 14:17] =>  0:35
:END:
<2020-08-17 Mon 13:30-14:30>
- [ ] Ført i Teams
- Ett prosjekt felles med Fysikk 2 - ubestemt vårpart
  - Alle timene i en uke
  - Numerisk og analytisk
** Sympy som alternativ til CAS
:LOGBOOK:
CLOCK: [2020-07-14 Tue 22:40]--[2020-07-14 Tue 23:11] =>  0:31
- [2020-07-13 Mon 22:06] \\
  Jobbet med løsningsforslag i R1 for årets eksamen
CLOCK: [2020-07-13 Mon 20:55]--[2020-07-13 Mon 22:06] =>  1:11
- [2020-07-12 Sun 23:08] \\
  Kan det være en idé å gjennomføre en fullstendig del 2 for en R1- og en R2-eksamen med Sympy og notebooks aleinee for å få litt oversikt over hvordan det fungerer?
CLOCK: [2020-07-12 Sun 22:27]--[2020-07-12 Sun 22:44] =>  0:17
CLOCK: [2020-07-12 Sun 22:10]--[2020-07-12 Sun 22:17] =>  0:07
CLOCK: [2020-07-12 Sun 21:36]--[2020-07-12 Sun 21:58] =>  0:22
CLOCK: [2020-07-12 Sun 20:14]--[2020-07-12 Sun 21:36] =>  1:22
:END:

**** Årsplan :ATTACH:
:PROPERTIES:
:ID:       ade190c4-3591-47a3-8966-4d73d67c2c89
:END:
:LOGBOOK:
- [2020-06-09 Tue 15:21] \\
  Det er en grei oversikt over hvordan jeg ønsker det i notater.
- [2020-06-09 Tue 14:38] \\
  Lagt inn vedlegg, Karolines årsplan for skoleåret som er på vei til å bli ferdig.
CLOCK: [2020-06-09 Tue 14:38]--[2020-06-09 Tue 15:21] =>  0:43
:END:
- 34--39 :: Integrasjon - kapittel 1 og 6
- 39--40, 41--45 :: Trigonometri - kapittel 2 og 3
- 48--50, 1--5 :: Vektorer og romgeometri - kapittel 4 og 5
- 6--7, 9--12 :: Differensiallikninger - kapittel 7
- 13--16 :: Følger og rekker - kapittel 8

#+begin_src shell :async :results silent
jupyter lab --notebook-dir="/home/tarjei/repos/munch/r2"
#+end_src

| Dato             | Tema       | Fagstoff | Stikkord              | Filer | Annet |
|------------------+------------+----------+-----------------------+-------+-------|
| [2020-06-09 Tue] | Derivasjon | K1.1     | $f'(x)=\frac{df}{dx}$ |       |       |

** Økter
:LOGBOOK:
CLOCK: [2020-07-19 Sun 12:34]--[2020-07-19 Sun 12:43] =>  0:09
:END:
** Opplegg for minitester
:LOGBOOK:
- [2020-08-05 Wed 15:13] \\
  Arbeid med [[file:minitester/mt1_integrasjon.tex]].
CLOCK: [2020-08-05 Wed 14:11]--[2020-08-05 Wed 15:13] =>  1:02
CLOCK: [2020-07-26 Sun 21:00]--[2020-07-26 Sun 22:31] =>  1:31
:END:
- [2020-07-26 Sun 21:28] :: Her bruker jeg ~\documentclass{exam}~, og følger introen fra [[https://www.overleaf.com/learn/latex/Typesetting%20exams%20in%20LaTeX][overleaf]], det er også en del å hente på [[https://en.wikibooks.org/wiki/LaTeX/Teacher%27s_Corner][wikibooks]].

** Opplegg for tavler
:LOGBOOK:
CLOCK: [2020-08-05 Wed 14:05]--[2020-08-05 Wed 14:05] =>  0:00
- [2020-08-05 Wed 14:05] \\
  Forsøkte å gjøre noe med tavler i de vanlige notatbøkene, [[cite:bærland20][20200805]], men det blir for liten plass ... da er det vel A4-ark som er veien å gå?
:END:

** Introduksjonsvideo til Sympy og Jupyter lab
:LOGBOOK:
CLOCK: [2020-08-27 Thu 13:23]--[2020-08-27 Thu 14:05] =>  0:42
CLOCK: [2020-08-27 Thu 09:27]--[2020-08-27 Thu 09:28] =>  0:01
:END:

- Sympy er et alternativ til CAS i Geogebra
- Jupyter lab er et slags alternativ til Word + Geogebra

- [X] Oppstart :: "Anaconda Navigator" -> "Jupyter Lab" || "Jupyter Notebook"
- [X] Løse enkle oppgaver
- [X] Sette inn figurer
- [X] Skrive ut som pdf

** matte.py
:LOGBOOK:
CLOCK: [2020-08-27 Thu 09:25]--[2020-08-27 Thu 10:39] =>  1:14
:END:
** Eksportopplegg :ATTACH:
:PROPERTIES:
:ID:       a7d4bb80-6baa-4ed0-a729-fab4f73a0224
:END:
:LOGBOOK:
CLOCK: [2020-08-27 Thu 15:22]--[2020-08-27 Thu 16:33] =>  1:11
CLOCK: [2020-08-27 Thu 12:01]--[2020-08-27 Thu 12:22] =>  0:21
:END:
- Her er jeg usikker på hva jeg ønsker. Det burde holdes så enkelt som mulig, og kanskje er det også greit å unngå at dette blir en nettside?
- Se [[attachment:Tempoplan_for_Sinus_R2_utgave_2015.pdf][tempoplanforslag fra forlaget]].

